# QTWriteFrame

## Description
Captures the active document window and writes a frame to the specified QuickTime movie file.

```pascal
PROCEDURE QTWriteFrame(movieRef : INTEGER);
```

```python

def vs.QTWriteFrame(movieRef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|movieRef|INTEGER|Index of QuickTime movie stream.|

## Remarks
This function will likely also draw to the screen as a pseudo-progress indicator.

## Version
Availability: from VectorWorks8.5
## Category
* Special - QuickTime